
"qtMovieViewAccessibilityMovie" = "movie";
"qtMovieViewAccessibilityRole" = "role";
"qtMovieViewAccessibilitySubrole" = "sub role";
"qtMovieViewAccessibilityView" = "view";
"qtMovieViewAccessibilityImage" = "image";

"qtMovieViewContextMenuFlashBack" = "Back";
"qtMovieViewContextMenuFlashForward" = "Forward";
"qtMovieViewContextMenuFlashLoop" = "Loop";
"qtMovieViewContextMenuFlashPlay" = "Play";
"qtMovieViewContextMenuFlashRewind" = "Rewind";
"qtMovieViewContextMenuFlashShowAll" = "Show All";
"qtMovieViewContextMenuFlashZoomIn" = "Zoom In";
"qtMovieViewContextMenuFlashZoomOut" = "Zoom Out";

"qtMovieViewContextMenuLinearCopy" = "Copy";
"qtMovieViewContextMenuLinearCut" = "Cut";
"qtMovieViewContextMenuLinearPaste" = "Paste";
"qtMovieViewContextMenuLinearPlay" = "Play";
"qtMovieViewContextMenuLinearRedo" = "Redo";
"qtMovieViewContextMenuLinearSelectAll" = "Select All";
"qtMovieViewContextMenuLinearSelectNone" = "Select None";
"qtMovieViewContextMenuLinearStop" = "Stop";
"qtMovieViewContextMenuLinearUndo" = "Undo";

"qtMovieViewEditCut" = "Cut";
"qtMovieViewEditCopy" = "Copy";
"qtMovieViewEditPaste" = "Paste";
"qtMovieViewEditDelete" = "Clear";
"qtMovieViewEditAdd" = "Add";
"qtMovieViewEditAddScaled" = "Add Scaled";
"qtMovieViewEditReplace" = "Replace";
"qtMovieViewEditTrim" = "Trim";
"qtMovieViewEditDrop" = "Drop";

"qtMovieFlattenOperation" = "Flattening movie...";
"qtMovieInsertTrackSegmentOperation" = "Inserting track segment...";
"qtMovieInsertMovieSegmentOperation" = "Inserting movie segment...";
"qtMoviePasteOperation" = "Pasting...";
"qtMovieAddMovieSelectionOperation" = "Adding movie selection...";
"qtMovieCopyOperation" = "Copying...";
"qtMovieCutOperation" = "Cutting...";
"qtMovieLoadMovieIntoRamOperation" = "Loading movie into RAM...";
"qtMovieLoadTrackIntoRamOperation" = "Loading track into RAM...";
"qtMovieLoadMediaIntoRamOperation" = "Loading media into RAM...";
"qtMovieImportOperation" = "Importing movie...";
"qtMovieExportOperation" = "Exporting movie...";
"qtMovieUnknownOperation" = "Performing unknown operation...";

"qtMovieViewClippingName" = "Movie Clipping ";

"QTMoviePosterTimeAttribute" = "Set Poster Time";
"QTTrackHighQualityVideoAttribute" = "Set High Quality Video";
"QTTrackDeinterlaceVideoAttribute" = "Set Deinterlace Video";
"QTTrackSingleFieldVideoAttribute" = "Set Single Field Video";
"QTTrackPreloadTrackAttribute" = "Set Preload Track";
"QTTrackNeverPurgeTrackAttribute" = "Set Never Purge Track";
"QTTrackMatrixAttribute" = "Set Track Matrix";
"QTTrackChapterlistAttribute" = "Set Chapter List";
"QTTrackMaskAttribute" = "Set Track Mask";
"QTTrackVolumeAttribute" = "Set Track Volume";
"QTTrackBalanceAttribute" = "Set Track Balance";
"QTTrackHrefAttribute" = "Set Track HREF";
"QTTrackTransferModeAttribute" = "Set Video Transfer Mode";
"QTTrackOperationColorAttribute" = "Set Video Operation Color";
"QTTrackEnabledAttribute" = "Set Track Enabled";
"QTTrackLanguageAttribute" = "Set Track Language";
"QTTrackLayerAttribute" = "Set Track Layer";
"QTTrackDisplayNameAttribute" = "Set Track Name";

"QTTrackDefaultName" = "Track";
"QTTextTrackDefaultName" = "Text Track";
"QTChapterTrackDefaultName" = "Chapter Track";
"QTVideoTrackDefaultName" = "Video Track";
"QTSoundTrackDefaultName" = "Sound Track";
"QTSubtitleTrackDefaultName" = "Subtitle Track";
"QTClosedCaptionTrackDefaultName" = "Closed Caption Track";

"QTFormatDescriptionVideoFormatSummary" = "%@, %.0f x %.0f";
"QTFormatDescriptionVideoWithCleanApertureFormatSummary" = "%@, %.0f x %.0f (%.0f x %.0f)";

"QTFormatDescriptionProtectedAACFormat" = "AAC (Protected)";
"QTFormatDescriptionProtectedAC3Format" = "AC3 (Protected)";
"QTFormatDescriptionGenericVideoMediaFormatSummary" = "Video Media";
"QTFormatDescriptionGenericAudioMediaFormatSummary" = "Audio Media";
"QTFormatDescriptionGenericMuxedMediaFormatSummary" = "Muxed Media";
"QTFormatDescriptionGenericTextMediaFormatSummary" = "Text Media";
"QTFormatDescriptionGenericUnknownMediaFormatSummary" = "Unknown Media";

"QTFormatDescriptionMPEG1SystemMuxedMediaFormatSummary" = "MPEG-1 System Stream";
"QTFormatDescriptionMPEG2TransportMuxedMediaFormatSummary" = "MPEG-2 Transport Stream";
"QTFormatDescriptionMPEG2ProgramMuxedMediaFormatSummary" = "MPEG-2 Program Stream";
"QTFormatDescriptionDVMuxedMediaFormatSummary" = "DV Muxed Stream";

"QTCaptureDeviceUnknownDevice" = "Unknown Device";

/* QTCompressionOptions localized names */
"QTCompressionOptionsLosslessAppleIntermediateVideo_displayName" = "Apple Intermediate";
"QTCompressionOptionsLosslessAnimationVideo_displayName" = "Animation Best Quality";
"QTCompressionOptionsJPEGVideo_displayName" = "JPEG High Quality";
"QTCompressionOptions120SizeH264Video_displayName" = "H.264 160x120";
"QTCompressionOptions240SizeH264Video_displayName" = "H.264 320x240";
"QTCompressionOptionsSD480SizeH264Video_displayName" = "H.264 SD";
"QTCompressionOptionsHD720SizeH264Video_displayName" = "H.264 HD 720";
"QTCompressionOptionsHD1080SizeH264Video_displayName" = "H.264 HD 1080";
"QTCompressionOptionsPrivateH264Video_displayName" = "H.264 High Quality";
"QTCompressionOptions120SizeMPEG4Video_displayName" = "MPEG-4 160x120";
"QTCompressionOptions240SizeMPEG4Video_displayName" = "MPEG-4 320x240";
"QTCompressionOptionsSD480SizeMPEG4Video_displayName" = "MPEG-4 SD";
"QTCompressionOptionsHD720SizeMPEG4Video_displayName" = "MPEG-4 HD 720";
"QTCompressionOptionsHD1080SizeMPEG4Video_displayName" = "MPEG-4 HD 1080";
"QTCompressionOptionsLosslessALACAudio_displayName" = "Apple Lossless";
"QTCompressionOptionsHighQualityAACAudio_displayName" = "AAC High Quality";
"QTCompressionOptionsVoiceQualityAACAudio_displayName" = "AAC Voice Quality";

"QTCompressionOptionsLosslessALACAudio_compressionOptionsSummary" = "Format: Apple Lossless";
"QTCompressionOptionsHighQualityAACAudio_compressionOptionsSummary" = "Format: AAC\nBit rate: 128 kbps per channel";
"QTCompressionOptionsVoiceQualityAACAudio_compressionOptionsSummary" = "Format: AAC\nBit rate: 32 kbps per channel\nSample rate: 22.050 kHz";

"QTCompressionOptionsCompressorSummary" = "Compression: %@";
"QTCompressionOptionsSizeSummary" = "Maximum size: %d x %d";

"qtKitError" = "Error";
/*these strings are taken directly from ErrorResources.h*/
"qtKitErrorString34" = "The disk is full.";
"qtKitErrorString35" = "A volume could not be found.";
"qtKitErrorString36" = "An I/O error occurred.";
"qtKitErrorString37" = "An invalid filename or volume name was encountered.";
"qtKitErrorString38" = "A file is not open.";
"qtKitErrorString39" = "The end of the file was reached.";
"qtKitErrorString41" = "Memory is full.";
"qtKitErrorString42" = "Too many files are open.";
"qtKitErrorString43" = "A file or directory could not be found.";
"qtKitErrorString44" = "A volume is locked.";
"qtKitErrorString45" = "A file is locked.";
"qtKitErrorString46" = "A volume is locked.";
"qtKitErrorString47" = "The file is busy.";
"qtKitErrorString48" = "A file by that name already exists.";
"qtKitErrorString192" = "A required resource was not found.";
"qtKitErrorString193" = "A required resource file was not found.";
"qtKitErrorString194" = "An attempt to add a resource to the file failed.";
"qtKitErrorString195" = "An attempt to add a resource reference to the file failed.";
"qtKitErrorString196" = "An attempt to remove a resource failed.";
"qtKitErrorString197" = "An attempt to remove a resource reference failed.";
"qtKitErrorString198" = "A resource with an inconsistent attribute was found.";
"qtKitErrorString199" = "The resource map is incorrect.";
"qtKitErrorString1409" = "The specified file fork does not exist.";
"qtKitErrorString2000" = "A necessary data reference could not be resolved.";
"qtKitErrorString2001" = "An invalid image description was found in the movie.";
"qtKitErrorString2002" = "An invalid public movie atom was found in the movie.";
"qtKitErrorString2003" = "A data handler needed by the movie could not be found.";
"qtKitErrorString2004" = "A data handler needed by the movie could not be opened.";
"qtKitErrorString2005" = "An invalid component type was found in the movie.";
"qtKitErrorString2006" = "A media handler needed by the movie could not be found.";
"qtKitErrorString2007" = "A data handler needed by the movie could not be found.";
"qtKitErrorString2008" = "Invalid media data was found in the movie.";
"qtKitErrorString2009" = "An invalid track was found in the movie.";
"qtKitErrorString2010" = "The movie contains some invalid data.";
"qtKitErrorString2011" = "The movie contains an invalid sample table.";
"qtKitErrorString2012" = "The movie contains an invalid data reference.";
"qtKitErrorString2013" = "The movie contains an invalid data handler.";
"qtKitErrorString2014" = "The movie contains an incorrect duration.";
"qtKitErrorString2015" = "The movie contains an incorrect time value.";
"qtKitErrorString2016" = "A public movie atom could not be saved in the movie.";
"qtKitErrorString2017" = "The movie has an invalid edit list.";
"qtKitErrorString2018" = "The movie’s media types don’t match.";
"qtKitErrorString2019" = "The operation was canceled.";
"qtKitErrorString2020" = "The Movies Toolbox has not been initialized.";
"qtKitErrorString2021" = "A needed working file was not found.";
"qtKitErrorString2022" = "A single fork file could not be created.";
"qtKitErrorString2023" = "The edit state was invalid.";
"qtKitErrorString2024" = "The edit state did not match.";
"qtKitErrorString2025" = "The edit state is stale.";
"qtKitErrorString2026" = "Some of the movie’s user data is missing.";
"qtKitErrorString2027" = "There is an error in the program.";
"qtKitErrorString2028" = "An incorrect track index was given.";
"qtKitErrorString2029" = "A track ID number could not be found.";
"qtKitErrorString2030" = "A given track was not in the movie.";
"qtKitErrorString2031" = "A specified time was not in a given track.";
"qtKitErrorString2032" = "A specified time was not in a given media.";
"qtKitErrorString2033" = "An incorrect edit index was given.";
"qtKitErrorString2034" = "An unexpected QuickTime error occurred.";
"qtKitErrorString2035" = "A necessary track could not be enabled.";
"qtKitErrorString2036" = "An invalid rectangle was found in the movie.";
"qtKitErrorString2037" = "An invalid sample number was found in the movie.";
"qtKitErrorString2038" = "An invalid chunk number was found in the movie.";
"qtKitErrorString2039" = "An invalid sample description index was found in the movie.";
"qtKitErrorString2040" = "An invalid chunk cache was found in the movie.";
"qtKitErrorString2041" = "An invalid sample description was found in the movie.";
"qtKitErrorString2042" = "The file’s data fork was not open for reading.";
"qtKitErrorString2043" = "The file’s data fork was not open for writing.";
"qtKitErrorString2044" = "The file’s data fork was already open for writing.";
"qtKitErrorString2045" = "The file’s data fork was already closed.";
"qtKitErrorString2046" = "The end of the movie data was reached.";
"qtKitErrorString2047" = "An invalid data reference was encountered.";
"qtKitErrorString2048" = "The file is not a movie file.";
"qtKitErrorString2049" = "An invalid data reference container was found in the movie.";
"qtKitErrorString2050" = "An invalid data reference index was found in the movie.";
"qtKitErrorString2051" = "The movie does not have any data files on disk. Please save the movie and try again.";
"qtKitErrorString2052" = "An existing data sample could not be used.";
"qtKitErrorString2053" = "The application attempted to use an unsupported feature.";
"qtKitErrorString2125" = "The offset in the file is too big.";
"qtKitErrorString2149" = "Not enough movie data is available.";
"qtKitErrorString5000" = "You do not have sufficient permissions for this operation.";
"qtKitErrorString8969" = "The movie contains some invalid data.";

/* QTKitErrorDomain error strings */
"QTKitErrorDomain_QTErrorUnknown_Description"									= "Operation could not be completed.";
"QTKitErrorDomain_QTErrorUnknown_FailureReason"									= "The operation could not be completed due to an unknown error. (%@)";
"QTKitErrorDomain_QTErrorInvalidInputsOrOutputs_Description"					= "Media cannot be captured.";
"QTKitErrorDomain_QTErrorInvalidInputsOrOutputs_FailureReason"					= "Some media sources are incompatible with media destinations.";
"QTKitErrorDomain_QTErrorDeviceAlreadyUsedbyAnotherSession_Description"			= "Could not capture media from the device \"%@\" because it is already in use elsewhere in this application.";
"QTKitErrorDomain_QTErrorDeviceAlreadyUsedbyAnotherSession_RecoverySuggestion"	= "Try stopping any operations that are using the device \"%@\" or waiting for those operations to complete.";
"QTKitErrorDomain_QTErrorNoDataCaptured_Description"							= "Recording failed because no data was received.";
"QTKitErrorDomain_QTErrorNoDataCaptured_RecoverySuggestion"						= "Make sure that the media input source is turned on and playing.";
"QTKitErrorDomain_QTErrorSessionConfigurationChanged_Description"				= "Recording stopped because the configuration of media sources and destinations changed.";
"QTKitErrorDomain_QTErrorSessionConfigurationChanged_RecoverySuggestion"		= "Try recording again.";
"QTKitErrorDomain_QTErrorDiskFull_Description"									= "Recording to \"%@\" stopped because the disk \"%@\" is getting full.";
"QTKitErrorDomain_QTErrorDiskFull_RecoverySuggestion"							= "Try deleting files from the disk \"%@\" or recording to another disk.";
"QTKitErrorDomain_QTErrorDeviceWasDisconnected_Description"						= "Recording stopped because the device \"%@\" was turned off or disconnected.";
"QTKitErrorDomain_QTErrorDeviceWasDisconnected_RecoverySuggestion"				= "Try turning on or reconnecting the device \"%@\" to continue recording.";
"QTKitErrorDomain_QTErrorMediaChanged_Description"								= "Recording stopped because the format of the source media changed.";
"QTKitErrorDomain_QTErrorMediaChanged_FailureReason"							= "Media of different formats cannot be recorded to the same file.";
"QTKitErrorDomain_QTErrorMaximumDurationReached_Description"					= "Recording stopped because the file cannot be longer than %@.";
"QTKitErrorDomain_QTErrorMaximumDurationReached_FailureReason"					= "The maximum duration is %@.";
"QTKitErrorDomain_QTErrorMaximumFileSizeReached_Description"					= "Recording stopped because the file cannot be larger than %@.";
"QTKitErrorDomain_QTErrorMaximumFileSizeReached_FailureReason"					= "The maximum file size is %@.";
"QTKitErrorDomain_QTErrorMediaDiscontinuity_Description"						= "Recording stopped because there was an interruption in the input media.";
"QTKitErrorDomain_QTErrorMediaDiscontinuity_RecoverySuggestion"					= "Try quitting applications or disconnecting devices that are using resources needed for recording.";
"QTKitErrorDomain_QTErrorDeviceNotConnected_Description"						= "The device \"%@\" could not be opened because it is not connected or turned on.";
"QTKitErrorDomain_QTErrorDeviceNotConnected_RecoverySuggestion"					= "Try turning on or connecting the device \"%@\" before opening it.";
"QTKitErrorDomain_QTErrorDeviceNotConnected_UnknownDevice_Description"          = "A device could not be opened because it is not connected or turned on.";
"QTKitErrorDomain_QTErrorDeviceNotConnected_UnknownDevice_RecoverySuggestion"   = "Try turning on or connecting devices before opening them.";
"QTKitErrorDomain_QTErrorDeviceInUseByAnotherApplication_Description"			= "The device \"%@\" could not be opened because it is in use by another application.";
"QTKitErrorDomain_QTErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Stop any operations that are using the device \"%@\", wait for those operations to complete, or quit the application using the device.";
"QTKitErrorDomain_QTErrorDeviceExcludedByAnotherDevice_Description"				= "The device \"%@\" could not be opened because a conflicting device \"%@\" is already open.";
"QTKitErrorDomain_QTErrorDeviceExcludedByAnotherDevice_RecoverySuggestion"		= "Try stopping any operations that use the device \"%@\".";
"QTKitErrorDomain_QTErrorMaximumNumberOfSamplesForFileFormatReached_Description"        = "Recording stopped because the maximum duration for the file has been reached.";
"QTKitErrorDomain_QTErrorMaximumNumberOfSamplesForFileFormatReached_RecoverySuggestion" = "Try continuing recording in a new file.";

"qtKitDataSizeInBytes" = "%@ bytes";
"qtKitDataSizeInKilobytes" = "%@ KB";
"qtKitDataSizeInMegabytes" = "%@ MB";
"qtKitDataSizeInGigabytes" = "%@ GB";
"qtKitDataSizeInTerabytes" = "%@ TB";
"qtKitDataSizeInPetabytes" = "%@ PB";
"qtKitDataSizeInExabytes" = "%@ EB";
"qtKitInexactAndExactDataSize" = "%@ (%@)";	/* Data size in a certain unit followed by the exact size in bytes */

"qtKitBitDepthStringForBlackAndWhiteColors" = "Black & White";
"qtKitBitDepthStringForFourColors" = "4";
"qtKitBitDepthStringForSixteenColors" = "16";
"qtKitBitDepthStringForTwoHundredFiftySixColors" = "256";
"qtKitBitDepthStringForThousandsColors" = "Thousands";
"qtKitBitDepthStringForMillionsColors" = "Millions";
"qtKitBitDepthStringForMillionsPlusColors" = "Millions+";
"qtKitBitDepthStringForUnknownColors" = "Unknown";
"qtKitBitDepthStringForColorsColors" = "Colors";
"qtKitBitDepthStringForGrayColors" = "Grays";
